xMasterX/all-the-plugins/non_catalog_apps/chess/sam/stm32_sam.cpp
    ']',        'F' | 0x80, ' ',        '(',        'F',        ')',        ' ',        '=',
    'E',        'H',        '4',        'F' | 0x80, '(',        'F',        'U',        'L',
    ')',        '=',        'F',        'U',        'H',        'L' | 0x80, '(',        'F',
    'R',        'I',        'E',        'N',        'D',        ')',        '=',        'F',
    'R',        'E',        'H',        '5',        'N',        'D' | 0x80, '(',        'F',
    'A',        'T',        'H',        'E',        'R',        ')',        '=',        'F',
    'A',        'A',        '4',        'D',        'H',        'E',        'R' | 0x80, '(',
    'F',        ')',        'F',        '=' | 0x80, '(',        'F',        ')',        '=',
    'F' | 0x80,

    ']',        'G' | 0x80, ' ',        '(',        'G',        ')',        ' ',        '=',
    'J',        'I',        'Y',        '4' | 0x80, '(',        'G',        'I',        'V',
    ')',        '=',        'G',        'I',        'H',        '5',        'V' | 0x80, ' ',
    '(',        'G',        ')',        'I',        '^',        '=',        'G' | 0x80, '(',
    'G',        'E',        ')',        'T',        '=',        'G',        'E',        'H',
    '5' | 0x80, 'S',        'U',        '(',        'G',        'G',        'E',        'S',
    ')',        '=',        'G',        'J',        'E',        'H',        '4',        'S' | 0x80,
    '(',        'G',        'G',        ')',        '=',        'G' | 0x80, ' ',        'B',
    '#',        '(',        'G',        ')',        '=',        'G' | 0x80, '(',        'G',
    ')',        '+',        '=',        'J' | 0x80, '(',        'G',        'R',        'E',
    'A',        'T',        ')',        '=',        'G',        'R',        'E',        'Y',
    '4',        'T' | 0x80, '(',        'G',        'O',        'N',        ')',        'E',
    '=',        'G',        'A',        'O',        '5',        'N' | 0x80, '#',        '(',
    'G',        'H',        ')',        '=' | 0x80, ' ',        '(',        'G',        'N',
    ')',        '=',        'N' | 0x80, '(',        'G',        ')',        '=',        'G' | 0x80,

    ']',        'H' | 0x80, ' ',        '(',        'H',        ')',        ' ',        '=',
    'E',        'Y',        '4',        'C',        'H' | 0x80, ' ',        '(',        'H',
    'A',        'V',        ')',        '=',        '/',        'H',        'A',        'E',
    '6',        'V' | 0x80, ' ',        '(',        'H',        'E',        'R',        'E',
    ')',        '=',        '/',        'H',        'I',        'Y',        'R' | 0x80, ' ',
    '(',        'H',        'O',        'U',        'R',        ')',        '=',        'A',
    'W',        '5',        'E',        'R' | 0x80, '(',        'H',        'O',        'W',
    ')',        '=',        '/',        'H',        'A',        'W' | 0x80, '(',        'H',
    ')',        '#',        '=',        '/',        'H' | 0x80, '(',        'H',        ')',
    '=' | 0x80,

    ']',        'I' | 0x80, ' ',        '(',        'I',        'N',        ')',        '=',
    'I',        'H',        'N' | 0x80, ' ',        '(',        'I',        ')',        ' ',
    '=',        'A',        'Y',        '4' | 0x80, '(',        'I',        ')',        ' ',
    '=',        'A',        'Y' | 0x80, '(',        'I',        'N',        ')',        'D',
    '=',        'A',        'Y',        '5',        'N' | 0x80, 'S',        'E',        'M',
    '(',        'I',        ')',        '=',        'I',        'Y' | 0x80, ' ',        'A',
    'N',        'T',        '(',        'I',        ')',        '=',        'A',        'Y' | 0x80,
    '(',        'I',        'E',        'R',        ')',        '=',        'I',        'Y',
    'E',        'R' | 0x80, '#',        ':',        'R',        '(',        'I',        'E',
    'D',        ')',        ' ',        '=',        'I',        'Y',        'D' | 0x80, '(',
    'I',        'E',        'D',        ')',        ' ',        '=',        'A',        'Y',
    '5',        'D' | 0x80, '(',        'I',        'E',        'N',        ')',        '=',
    'I',        'Y',        'E',        'H',        'N' | 0x80, '(',        'I',        'E',
    ')',        'T',        '=',        'A',        'Y',        '4',        'E',        'H' | 0x80,
    '(',        'I',        '\'',       ')',        '=',        'A',        'Y',        '5' | 0x80,
    ' ',        ':',        '(',        'I',        ')',        '^',        '%',        '=',
    'A',        'Y',        '5' | 0x80, ' ',        ':',        '(',        'I',        'E',
    ')',        ' ',        '=',        'A',        'Y',        '4' | 0x80, '(',        'I',
    ')',        '%',        '=',        'I',        'Y' | 0x80, '(',        'I',        'E',
    ')',        '=',        'I',        'Y',        '4' | 0x80, ' ',        '(',        'I',
    'D',        'E',        'A',        ')',        '=',        'A',        'Y',        'D',
    'I',        'Y',        '5',        'A',        'H' | 0x80, '(',        'I',        ')',
    '^',        '+',        ':',        '#',        '=',        'I',        'H' | 0x80, '(',
    'I',        'R',        ')',        '#',        '=',        'A',        'Y',        'R' | 0x80,
    '(',        'I',        'Z',        ')',        '%',        '=',        'A',        'Y',
    'Z' | 0x80, '(',        'I',        'S',        ')',        '%',        '=',        'A',
    'Y',        'Z' | 0x80, 'I',        '^',        '(',        'I',        ')',        '^',
    '#',        '=',        'I',        'H' | 0x80, '+',        '^',        '(',        'I',
    ')',        '^',        '+',        '=',        'A',        'Y' | 0x80, '#',        ':',
    '^',        '(',        'I',        ')',        '^',        '+',        '=',        'I',
    'H' | 0x80, '(',        'I',        ')',        '^',        '+',        '=',        'A',
    'Y' | 0x80, '(',        'I',        'R',        ')',        '=',        'E',        'R' | 0x80,
    '(',        'I',        'G',        'H',        ')',        '=',        'A',        'Y',
    '4' | 0x80, '(',        'I',        'L',        'D',        ')',        '=',        'A',
    'Y',        '5',        'L',        'D' | 0x80, ' ',        '(',        'I',        'G',
    'N',        ')',        '=',        'I',        'H',        'G',        'N' | 0x80, '(',
    'I',        'G',        'N',        ')',        ' ',        '=',        'A',        'Y',
    '4',        'N' | 0x80, '(',        'I',        'G',        'N',        ')',        '^',
    '=',        'A',        'Y',        '4',        'N' | 0x80, '(',        'I',        'G',
    'N',        ')',        '%',        '=',        'A',        'Y',        '4',        'N' | 0x80,
    '(',        'I',        'C',        'R',        'O',        ')',        '=',        'A',
    'Y',        '4',        'K',        'R',        'O',        'H' | 0x80, '(',        'I',
    'Q',        'U',        'E',        ')',        '=',        'I',        'Y',        '4',
    'K' | 0x80, '(',        'I',        ')',        '=',        'I',        'H' | 0x80,

