xMasterX/all-the-plugins/non_catalog_apps/chess/sam/stm32_sam.cpp
    ']',        'J' | 0x80, ' ',        '(',        'J',        ')',        ' ',        '=',
    'J',        'E',        'Y',        '4' | 0x80, '(',        'J',        ')',        '=',
    'J' | 0x80,

    ']',        'K' | 0x80, ' ',        '(',        'K',        ')',        ' ',        '=',
    'K',        'E',        'Y',        '4' | 0x80, ' ',        '(',        'K',        ')',
    'N',        '=' | 0x80, '(',        'K',        ')',        '=',        'K' | 0x80,

    ']',        'L' | 0x80, ' ',        '(',        'L',        ')',        ' ',        '=',
    'E',        'H',        '4',        'L' | 0x80, '(',        'L',        'O',        ')',
    'C',        '#',        '=',        'L',        'O',        'W' | 0x80, 'L',        '(',
    'L',        ')',        '=' | 0x80, '#',        ':',        '^',        '(',        'L',
    ')',        '%',        '=',        'U',        'L' | 0x80, '(',        'L',        'E',
    'A',        'D',        ')',        '=',        'L',        'I',        'Y',        'D' | 0x80,
    ' ',        '(',        'L',        'A',        'U',        'G',        'H',        ')',
    '=',        'L',        'A',        'E',        '4',        'F' | 0x80, '(',        'L',
    ')',        '=',        'L' | 0x80,

    ']',        'M' | 0x80, ' ',        '(',        'M',        ')',        ' ',        '=',
    'E',        'H',        '4',        'M' | 0x80, ' ',        '(',        'M',        'R',
    '.',        ')',        ' ',        '=',        'M',        'I',        'H',        '4',
    'S',        'T',        'E',        'R' | 0x80, ' ',        '(',        'M',        'S',
    '.',        ')',        '=',        'M',        'I',        'H',        '5',        'Z' | 0x80,
    ' ',        '(',        'M',        'R',        'S',        '.',        ')',        ' ',
    '=',        'M',        'I',        'H',        '4',        'S',        'I',        'X',
    'Z' | 0x80, '(',        'M',        'O',        'V',        ')',        '=',        'M',
    'U',        'W',        '4',        'V' | 0x80, '(',        'M',        'A',        'C',
    'H',        'I',        'N',        ')',        '=',        'M',        'A',        'H',
    'S',        'H',        'I',        'Y',        '5',        'N' | 0x80, 'M',        '(',
    'M',        ')',        '=' | 0x80, '(',        'M',        ')',        '=',        'M' | 0x80,

    ']',        'N' | 0x80, ' ',        '(',        'N',        ')',        ' ',        '=',
    'E',        'H',        '4',        'N' | 0x80, 'E',        '(',        'N',        'G',
    ')',        '+',        '=',        'N',        'J' | 0x80, '(',        'N',        'G',
    ')',        'R',        '=',        'N',        'X',        'G' | 0x80, '(',        'N',
    'G',        ')',        '#',        '=',        'N',        'X',        'G' | 0x80, '(',
    'N',        'G',        'L',        ')',        '%',        '=',        'N',        'X',
    'G',        'U',        'L' | 0x80, '(',        'N',        'G',        ')',        '=',
    'N',        'X' | 0x80, '(',        'N',        'K',        ')',        '=',        'N',
    'X',        'K' | 0x80, ' ',        '(',        'N',        'O',        'W',        ')',
    ' ',        '=',        'N',        'A',        'W',        '4' | 0x80, 'N',        '(',
    'N',        ')',        '=' | 0x80, '(',        'N',        'O',        'N',        ')',
    'E',        '=',        'N',        'A',        'H',        '4',        'N' | 0x80, '(',
    'N',        ')',        '=',        'N' | 0x80,

    ']',        'O' | 0x80, ' ',        '(',        'O',        ')',        ' ',        '=',
    'O',        'H',        '4',        'W' | 0x80, '(',        'O',        'F',        ')',
    ' ',        '=',        'A',        'H',        'V' | 0x80, ' ',        '(',        'O',
    'H',        ')',        ' ',        '=',        'O',        'W',        '5' | 0x80, '(',
    'O',        'R',        'O',        'U',        'G',        'H',        ')',        '=',
    'E',        'R',        '4',        'O',        'W' | 0x80, '#',        ':',        '(',
    'O',        'R',        ')',        ' ',        '=',        'E',        'R' | 0x80, '#',
    ':',        '(',        'O',        'R',        'S',        ')',        ' ',        '=',
    'E',        'R',        'Z' | 0x80, '(',        'O',        'R',        ')',        '=',
    'A',        'O',        'R' | 0x80, ' ',        '(',        'O',        'N',        'E',
    ')',        '=',        'W',        'A',        'H',        'N' | 0x80, '#',        '(',
    'O',        'N',        'E',        ')',        ' ',        '=',        'W',        'A',
    'H',        'N' | 0x80, '(',        'O',        'W',        ')',        '=',        'O',
    'W' | 0x80, ' ',        '(',        'O',        'V',        'E',        'R',        ')',
    '=',        'O',        'W',        '5',        'V',        'E',        'R' | 0x80, 'P',
    'R',        '(',        'O',        ')',        'V',        '=',        'U',        'W',
    '4' | 0x80, '(',        'O',        'V',        ')',        '=',        'A',        'H',
    '4',        'V' | 0x80, '(',        'O',        ')',        '^',        '%',        '=',
    'O',        'W',        '5' | 0x80, '(',        'O',        ')',        '^',        'E',
    'N',        '=',        'O',        'W' | 0x80, '(',        'O',        ')',        '^',
    'I',        '#',        '=',        'O',        'W',        '5' | 0x80, '(',        'O',
    'L',        ')',        'D',        '=',        'O',        'W',        '4',        'L' | 0x80,
    '(',        'O',        'U',        'G',        'H',        'T',        ')',        '=',
    'A',        'O',        '5',        'T' | 0x80, '(',        'O',        'U',        'G',
    'H',        ')',        '=',        'A',        'H',        '5',        'F' | 0x80, ' ',
    '(',        'O',        'U',        ')',        '=',        'A',        'W' | 0x80, 'H',
    '(',        'O',        'U',        ')',        'S',        '#',        '=',        'A',
    'W',        '4' | 0x80, '(',        'O',        'U',        'S',        ')',        '=',
    'A',        'X',        'S' | 0x80, '(',        'O',        'U',        'R',        ')',
    '=',        'O',        'H',        'R' | 0x80, '(',        'O',        'U',        'L',
    'D',        ')',        '=',        'U',        'H',        '5',        'D' | 0x80, '(',
    'O',        'U',        ')',        '^',        'L',        '=',        'A',        'H',
    '5' | 0x80, '(',        'O',        'U',        'P',        ')',        '=',        'U',
    'W',        '5',        'P' | 0x80, '(',        'O',        'U',        ')',        '=',
    'A',        'W' | 0x80, '(',        'O',        'Y',        ')',        '=',        'O',
    'Y' | 0x80, '(',        'O',        'I',        'N',        'G',        ')',        '=',
    'O',        'W',        '4',        'I',        'H',        'N',        'X' | 0x80, '(',
    'O',        'I',        ')',        '=',        'O',        'Y',        '5' | 0x80, '(',
    'O',        'O',        'R',        ')',        '=',        'O',        'H',        '5',
    'R' | 0x80, '(',        'O',        'O',        'K',        ')',        '=',        'U',
    'H',        '5',        'K' | 0x80, 'F',        '(',        'O',        'O',        'D',
    ')',        '=',        'U',        'W',        '5',        'D' | 0x80, 'L',        '(',
    'O',        'O',        'D',        ')',        '=',        'A',        'H',        '5',
    'D' | 0x80, 'M',        '(',        'O',        'O',        'D',        ')',        '=',
    'U',        'W',        '5',        'D' | 0x80, '(',        'O',        'O',        'D',
    ')',        '=',        'U',        'H',        '5',        'D' | 0x80, 'F',        '(',
    'O',        'O',        'T',        ')',        '=',        'U',        'H',        '5',
    'T' | 0x80, '(',        'O',        'O',        ')',        '=',        'U',        'W',
    '5' | 0x80, '(',        'O',        '\'',       ')',        '=',        'O',        'H' | 0x80,
    '(',        'O',        ')',        'E',        '=',        'O',        'W' | 0x80, '(',
    'O',        ')',        ' ',        '=',        'O',        'W' | 0x80, '(',        'O',
    'A',        ')',        '=',        'O',        'W',        '4' | 0x80, ' ',        '(',
    'O',        'N',        'L',        'Y',        ')',        '=',        'O',        'W',
    '4',        'N',        'L',        'I',        'Y' | 0x80, ' ',        '(',        'O',
    'N',        'C',        'E',        ')',        '=',        'W',        'A',        'H',
    '4',        'N',        'S' | 0x80, '(',        'O',        'N',        '\'',       'T',
    ')',        '=',        'O',        'W',        '4',        'N',        'T' | 0x80, 'C',
    '(',        'O',        ')',        'N',        '=',        'A',        'A' | 0x80, '(',
    'O',        ')',        'N',        'G',        '=',        'A',        'O' | 0x80, ' ',
    ':',        '^',        '(',        'O',        ')',        'N',        '=',        'A',
    'H' | 0x80, 'I',        '(',        'O',        'N',        ')',        '=',        'U',
    'N' | 0x80, '#',        ':',        '(',        'O',        'N',        ')',        '=',
    'U',        'N' | 0x80, '#',        '^',        '(',        'O',        'N',        ')',
    '=',        'U',        'N' | 0x80, '(',        'O',        ')',        'S',        'T',
    '=',        'O',        'W' | 0x80, '(',        'O',        'F',        ')',        '^',
    '=',        'A',        'O',        '4',        'F' | 0x80, '(',        'O',        'T',
    'H',        'E',        'R',        ')',        '=',        'A',        'H',        '5',
    'D',        'H',        'E',        'R' | 0x80, 'R',        '(',        'O',        ')',
    'B',        '=',        'R',        'A',        'A' | 0x80, '^',        'R',        '(',
    'O',        ')',        ':',        '#',        '=',        'O',        'W',        '5' | 0x80,
    '(',        'O',        'S',        'S',        ')',        ' ',        '=',        'A',
    'O',        '5',        'S' | 0x80, '#',        ':',        '^',        '(',        'O',
    'M',        ')',        '=',        'A',        'H',        'M' | 0x80, '(',        'O',
    ')',        '=',        'A',        'A' | 0x80,

    ']',        'P' | 0x80, ' ',        '(',        'P',        ')',        ' ',        '=',
    'P',        'I',        'Y',        '4' | 0x80, '(',        'P',        'H',        ')',
    '=',        'F' | 0x80, '(',        'P',        'E',        'O',        'P',        'L',
    ')',        '=',        'P',        'I',        'Y',        '5',        'P',        'U',
    'L' | 0x80, '(',        'P',        'O',        'W',        ')',        '=',        'P',
    'A',        'W',        '4' | 0x80, '(',        'P',        'U',        'T',        ')',
    ' ',        '=',        'P',        'U',        'H',        'T' | 0x80, '(',        'P',
    ')',        'P',        '=' | 0x80, '(',        'P',        ')',        'S',        '=' | 0x80,
    '(',        'P',        ')',        'N',        '=' | 0x80, '(',        'P',        'R',
    'O',        'F',        '.',        ')',        '=',        'P',        'R',        'O',
    'H',        'F',        'E',        'H',        '4',        'S',        'E',        'R' | 0x80,
    '(',        'P',        ')',        '=',        'P' | 0x80,

    ']',        'Q' | 0x80, ' ',        '(',        'Q',        ')',        ' ',        '=',
    'K',        'Y',        'U',        'W',        '4' | 0x80, '(',        'Q',        'U',
    'A',        'R',        ')',        '=',        'K',        'W',        'O',        'H',
    '5',        'R' | 0x80, '(',        'Q',        'U',        ')',        '=',        'K',
    'W' | 0x80, '(',        'Q',        ')',        '=',        'K' | 0x80, ']',        'R' | 0x80,
    ' ',        '(',        'R',        ')',        ' ',        '=',        'A',        'A',
    '5',        'R' | 0x80, ' ',        '(',        'R',        'E',        ')',        '^',
    '#',        '=',        'R',        'I',        'Y' | 0x80, '(',        'R',        ')',
    'R',        '=' | 0x80, '(',        'R',        ')',        '=',        'R' | 0x80,

