xMasterX/all-the-plugins/non_catalog_apps/chess/sam/stm32_sam.cpp
    ']',        'S' | 0x80, ' ',        '(',        'S',        ')',        ' ',        '=',
    'E',        'H',        '4',        'S' | 0x80, '(',        'S',        'H',        ')',
    '=',        'S',        'H' | 0x80, '#',        '(',        'S',        'I',        'O',
    'N',        ')',        '=',        'Z',        'H',        'U',        'N' | 0x80, '(',
    'S',        'O',        'M',        'E',        ')',        '=',        'S',        'A',
    'H',        'M' | 0x80, '#',        '(',        'S',        'U',        'R',        ')',
    '#',        '=',        'Z',        'H',        'E',        'R' | 0x80, '(',        'S',
    'U',        'R',        ')',        '#',        '=',        'S',        'H',        'E',
    'R' | 0x80, '#',        '(',        'S',        'U',        ')',        '#',        '=',
    'Z',        'H',        'U',        'W' | 0x80, '#',        '(',        'S',        'S',
    'U',        ')',        '#',        '=',        'S',        'H',        'U',        'W' | 0x80,
    '#',        '(',        'S',        'E',        'D',        ')',        '=',        'Z',
    'D' | 0x80, '#',        '(',        'S',        ')',        '#',        '=',        'Z' | 0x80,
    '(',        'S',        'A',        'I',        'D',        ')',        '=',        'S',
    'E',        'H',        'D' | 0x80, '^',        '(',        'S',        'I',        'O',
    'N',        ')',        '=',        'S',        'H',        'U',        'N' | 0x80, '(',
    'S',        ')',        'S',        '=' | 0x80, '.',        '(',        'S',        ')',
    ' ',        '=',        'Z' | 0x80, '#',        ':',        '.',        'E',        '(',
    'S',        ')',        ' ',        '=',        'Z' | 0x80, '#',        ':',        '^',
    '#',        '(',        'S',        ')',        ' ',        '=',        'S' | 0x80, 'U',
    '(',        'S',        ')',        ' ',        '=',        'S' | 0x80, ' ',        ':',
    '#',        '(',        'S',        ')',        ' ',        '=',        'Z' | 0x80, '#',
    '#',        '(',        'S',        ')',        ' ',        '=',        'Z' | 0x80, ' ',
    '(',        'S',        'C',        'H',        ')',        '=',        'S',        'K' | 0x80,
    '(',        'S',        ')',        'C',        '+',        '=' | 0x80, '#',        '(',
    'S',        'M',        ')',        '=',        'Z',        'U',        'M' | 0x80, '#',
    '(',        'S',        'N',        ')',        '\'',       '=',        'Z',        'U',
    'M' | 0x80, '(',        'S',        'T',        'L',        'E',        ')',        '=',
    'S',        'U',        'L' | 0x80, '(',        'S',        ')',        '=',        'S' | 0x80,

    ']',        'T' | 0x80, ' ',        '(',        'T',        ')',        ' ',        '=',
    'T',        'I',        'Y',        '4' | 0x80, ' ',        '(',        'T',        'H',
    'E',        ')',        ' ',        '#',        '=',        'D',        'H',        'I',
    'Y' | 0x80, ' ',        '(',        'T',        'H',        'E',        ')',        ' ',
    '=',        'D',        'H',        'A',        'X' | 0x80, '(',        'T',        'O',
    ')',        ' ',        '=',        'T',        'U',        'X' | 0x80, ' ',        '(',
    'T',        'H',        'A',        'T',        ')',        '=',        'D',        'H',
    'A',        'E',        'T' | 0x80, ' ',        '(',        'T',        'H',        'I',
    'S',        ')',        ' ',        '=',        'D',        'H',        'I',        'H',
    'S' | 0x80, ' ',        '(',        'T',        'H',        'E',        'Y',        ')',
    '=',        'D',        'H',        'E',        'Y' | 0x80, ' ',        '(',        'T',
    'H',        'E',        'R',        'E',        ')',        '=',        'D',        'H',
    'E',        'H',        'R' | 0x80, '(',        'T',        'H',        'E',        'R',
    ')',        '=',        'D',        'H',        'E',        'R' | 0x80, '(',        'T',
    'H',        'E',        'I',        'R',        ')',        '=',        'D',        'H',
    'E',        'H',        'R' | 0x80, ' ',        '(',        'T',        'H',        'A',
    'N',        ')',        ' ',        '=',        'D',        'H',        'A',        'E',
    'N' | 0x80, ' ',        '(',        'T',        'H',        'E',        'M',        ')',
    ' ',        '=',        'D',        'H',        'A',        'E',        'N' | 0x80, '(',
    'T',        'H',        'E',        'S',        'E',        ')',        ' ',        '=',
    'D',        'H',        'I',        'Y',        'Z' | 0x80, ' ',        '(',        'T',
    'H',        'E',        'N',        ')',        '=',        'D',        'H',        'E',
    'H',        'N' | 0x80, '(',        'T',        'H',        'R',        'O',        'U',
    'G',        'H',        ')',        '=',        'T',        'H',        'R',        'U',
    'W',        '4' | 0x80, '(',        'T',        'H',        'O',        'S',        'E',
    ')',        '=',        'D',        'H',        'O',        'H',        'Z' | 0x80, '(',
    'T',        'H',        'O',        'U',        'G',        'H',        ')',        ' ',
    '=',        'D',        'H',        'O',        'W' | 0x80, '(',        'T',        'O',
    'D',        'A',        'Y',        ')',        '=',        'T',        'U',        'X',
    'D',        'E',        'Y' | 0x80, '(',        'T',        'O',        'M',        'O',
    ')',        'R',        'R',        'O',        'W',        '=',        'T',        'U',
    'M',        'A',        'A',        '5' | 0x80, '(',        'T',        'O',        ')',
    'T',        'A',        'L',        '=',        'T',        'O',        'W',        '5' | 0x80,
    ' ',        '(',        'T',        'H',        'U',        'S',        ')',        '=',
    'D',        'H',        'A',        'H',        '4',        'S' | 0x80, '(',        'T',
    'H',        ')',        '=',        'T',        'H' | 0x80, '#',        ':',        '(',
    'T',        'E',        'D',        ')',        '=',        'T',        'I',        'X',
    'D' | 0x80, 'S',        '(',        'T',        'I',        ')',        '#',        'N',
    '=',        'C',        'H' | 0x80, '(',        'T',        'I',        ')',        'O',
    '=',        'S',        'H' | 0x80, '(',        'T',        'I',        ')',        'A',
    '=',        'S',        'H' | 0x80, '(',        'T',        'I',        'E',        'N',
    ')',        '=',        'S',        'H',        'U',        'N' | 0x80, '(',        'T',
    'U',        'R',        ')',        '#',        '=',        'C',        'H',        'E',
    'R' | 0x80, '(',        'T',        'U',        ')',        'A',        '=',        'C',
    'H',        'U',        'W' | 0x80, ' ',        '(',        'T',        'W',        'O',
    ')',        '=',        'T',        'U',        'W' | 0x80, '&',        '(',        'T',
    ')',        'E',        'N',        ' ',        '=' | 0x80, '(',        'T',        ')',
    '=',        'T' | 0x80,

    ']',        'U' | 0x80, ' ',        '(',        'U',        ')',        ' ',        '=',
    'Y',        'U',        'W',        '4' | 0x80, ' ',        '(',        'U',        'N',
    ')',        'I',        '=',        'Y',        'U',        'W',        'N' | 0x80, ' ',
    '(',        'U',        'N',        ')',        '=',        'A',        'H',        'N' | 0x80,
    ' ',        '(',        'U',        'P',        'O',        'N',        ')',        '=',
    'A',        'X',        'P',        'A',        'O',        'N' | 0x80, '@',        '(',
    'U',        'R',        ')',        '#',        '=',        'U',        'H',        '4',
    'R' | 0x80, '(',        'U',        'R',        ')',        '#',        '=',        'Y',
    'U',        'H',        '4',        'R' | 0x80, '(',        'U',        'R',        ')',
    '=',        'E',        'R' | 0x80, '(',        'U',        ')',        '^',        ' ',
    '=',        'A',        'H' | 0x80, '(',        'U',        ')',        '^',        '^',
    '=',        'A',        'H',        '5' | 0x80, '(',        'U',        'Y',        ')',
    '=',        'A',        'Y',        '5' | 0x80, ' ',        'G',        '(',        'U',
    ')',        '#',        '=' | 0x80, 'G',        '(',        'U',        ')',        '%',
    '=' | 0x80, 'G',        '(',        'U',        ')',        '#',        '=',        'W' | 0x80,
    '#',        'N',        '(',        'U',        ')',        '=',        'Y',        'U',
    'W' | 0x80, '@',        '(',        'U',        ')',        '=',        'U',        'W' | 0x80,
    '(',        'U',        ')',        '=',        'Y',        'U',        'W' | 0x80,

    ']',        'V' | 0x80, ' ',        '(',        'V',        ')',        ' ',        '=',
    'V',        'I',        'Y',        '4' | 0x80, '(',        'V',        'I',        'E',
    'W',        ')',        '=',        'V',        'Y',        'U',        'W',        '5' | 0x80,
    '(',        'V',        ')',        '=',        'V' | 0x80,

    ']',        'W' | 0x80, ' ',        '(',        'W',        ')',        ' ',        '=',
    'D',        'A',        'H',        '4',        'B',        'U',        'L',        'Y',
    'U',        'W' | 0x80, ' ',        '(',        'W',        'E',        'R',        'E',
    ')',        '=',        'W',        'E',        'R' | 0x80, '(',        'W',        'A',
    ')',        'S',        'H',        '=',        'W',        'A',        'A' | 0x80, '(',
    'W',        'A',        ')',        'S',        'T',        '=',        'W',        'E',
    'Y' | 0x80, '(',        'W',        'A',        ')',        'S',        '=',        'W',
    'A',        'H' | 0x80, '(',        'W',        'A',        ')',        'T',        '=',
    'W',        'A',        'A' | 0x80, '(',        'W',        'H',        'E',        'R',
    'E',        ')',        '=',        'W',        'H',        'E',        'H',        'R' | 0x80,
    '(',        'W',        'H',        'A',        'T',        ')',        '=',        'W',
    'H',        'A',        'H',        'T' | 0x80, '(',        'W',        'H',        'O',
    'L',        ')',        '=',        '/',        'H',        'O',        'W',        'L' | 0x80,
    '(',        'W',        'H',        'O',        ')',        '=',        '/',        'H',
    'U',        'W' | 0x80, '(',        'W',        'H',        ')',        '=',        'W',
    'H' | 0x80, '(',        'W',        'A',        'R',        ')',        '#',        '=',
    'W',        'E',        'H',        'R' | 0x80, '(',        'W',        'A',        'R',
    ')',        '=',        'W',        'A',        'O',        'R' | 0x80, '(',        'W',
    'O',        'R',        ')',        '^',        '=',        'W',        'E',        'R' | 0x80,
    '(',        'W',        'R',        ')',        '=',        'R' | 0x80, '(',        'W',
    'O',        'M',        ')',        'A',        '=',        'W',        'U',        'H',
    'M' | 0x80, '(',        'W',        'O',        'M',        ')',        'E',        '=',
    'W',        'I',        'H',        'M' | 0x80, '(',        'W',        'E',        'A',
    ')',        'R',        '=',        'W',        'E',        'H' | 0x80, '(',        'W',
    'A',        'N',        'T',        ')',        '=',        'W',        'A',        'A',
    '5',        'N',        'T' | 0x80, 'A',        'N',        'S',        '(',        'W',
    'E',        'R',        ')',        '=',        'E',        'R' | 0x80, '(',        'W',
    ')',        '=',        'W' | 0x80,

    ']',        'X' | 0x80, ' ',        '(',        'X',        ')',        ' ',        '=',
    'E',        'H',        '4',        'K',        'R' | 0x80, ' ',        '(',        'X',
    ')',        '=',        'Z' | 0x80, '(',        'X',        ')',        '=',        'K',
    'S' | 0x80,

    ']',        'Y' | 0x80, ' ',        '(',        'Y',        ')',        ' ',        '=',
    'W',        'A',        'Y',        '4' | 0x80, '(',        'Y',        'O',        'U',
    'N',        'G',        ')',        '=',        'Y',        'A',        'H',        'N',
    'X' | 0x80, ' ',        '(',        'Y',        'O',        'U',        'R',        ')',
    '=',        'Y',        'O',        'H',        'R' | 0x80, ' ',        '(',        'Y',
    'O',        'U',        ')',        '=',        'Y',        'U',        'W' | 0x80, ' ',
    '(',        'Y',        'E',        'S',        ')',        '=',        'Y',        'E',
    'H',        'S' | 0x80, ' ',        '(',        'Y',        ')',        '=',        'Y' | 0x80,
    'F',        '(',        'Y',        ')',        '=',        'A',        'Y' | 0x80, 'P',
    'S',        '(',        'Y',        'C',        'H',        ')',        '=',        'A',
    'Y',        'K' | 0x80, '#',        ':',        '^',        '(',        'Y',        ')',
    '=',        'I',        'Y' | 0x80, '#',        ':',        '^',        '(',        'Y',
    ')',        'I',        '=',        'I',        'Y' | 0x80, ' ',        ':',        '(',
    'Y',        ')',        ' ',        '=',        'A',        'Y' | 0x80, ' ',        ':',
    '(',        'Y',        ')',        '#',        '=',        'A',        'Y' | 0x80, ' ',
    ':',        '(',        'Y',        ')',        '^',        '+',        ':',        '#',
    '=',        'I',        'H' | 0x80, ' ',        ':',        '(',        'Y',        ')',
    '^',        '#',        '=',        'A',        'Y' | 0x80, '(',        'Y',        ')',
    '=',        'I',        'H' | 0x80,

    ']',        'Z' | 0x80, ' ',        '(',        'Z',        ')',        ' ',        '=',
    'Z',        'I',        'Y',        '4' | 0x80, '(',        'Z',        ')',        '=',
    'Z' | 0x80, 'j' | 0x80};

const unsigned char rules2[] = {
    '(',        'A',        ')',        '=' | 0x80, '(',        '!',        ')',        '=',
    '.' | 0x80, '(',        '"',        ')',        ' ',        '=',        '-',        'A',
    'H',        '5',        'N',        'K',        'W',        'O',        'W',        'T',
    '-' | 0x80, '(',        '"',        ')',        '=',        'K',        'W',        'O',
    'W',        '4',        'T',        '-' | 0x80, '(',        '#',        ')',        '=',
    ' ',        'N',        'A',        'H',        '4',        'M',        'B',        'E',
    'R' | 0x80, '(',        '$',        ')',        '=',        ' ',        'D',        'A',
    'A',        '4',        'L',        'E',        'R' | 0x80, '(',        '%',        ')',
    '=',        ' ',        'P',        'E',        'R',        'S',        'E',        'H',
    '4',        'N',        'T' | 0x80, '(',        '&',        ')',        '=',        ' ',
    'A',        'E',        'N',        'D' | 0x80, '(',        '\'',       ')',        '=' | 0x80,
    '(',        '*',        ')',        '=',        ' ',        'A',        'E',        '4',
    'S',        'T',        'E',        'R',        'I',        'H',        'S',        'K' | 0x80,
    '(',        '+',        ')',        '=',        ' ',        'P',        'L',        'A',
    'H',        '4',        'S' | 0x80, '(',        ',',        ')',        '=',        ',' | 0x80,
    ' ',        '(',        '-',        ')',        ' ',        '=',        '-' | 0x80, '(',
    '-',        ')',        '=' | 0x80, '(',        '.',        ')',        '=',        ' ',
    'P',        'O',        'Y',        'N',        'T' | 0x80, '(',        '/',        ')',
    '=',        ' ',        'S',        'L',        'A',        'E',        '4',        'S',
    'H' | 0x80, '(',        '0',        ')',        '=',        ' ',        'Z',        'I',
    'Y',        '4',        'R',        'O',        'W' | 0x80, ' ',        '(',        '1',
    'S',        'T',        ')',        '=',        'F',        'E',        'R',        '4',
    'S',        'T' | 0x80, ' ',        '(',        '1',        '0',        'T',        'H',
    ')',        '=',        'T',        'E',        'H',        '4',        'N',        'T',
    'H' | 0x80, '(',        '1',        ')',        '=',        ' ',        'W',        'A',
    'H',        '4',        'N' | 0x80, ' ',        '(',        '2',        'N',        'D',
    ')',        '=',        'S',        'E',        'H',        '4',        'K',        'U',
    'N',        'D' | 0x80, '(',        '2',        ')',        '=',        ' ',        'T',
    'U',        'W',        '4' | 0x80, ' ',        '(',        '3',        'R',        'D',
    ')',        '=',        'T',        'H',        'E',        'R',        '4',        'D' | 0x80,
    '(',        '3',        ')',        '=',        ' ',        'T',        'H',        'R',
    'I',        'Y',        '4' | 0x80, '(',        '4',        ')',        '=',        ' ',
    'F',        'O',        'H',        '4',        'R' | 0x80, ' ',        '(',        '5',
    'T',        'H',        ')',        '=',        'F',        'I',        'H',        '4',
    'F',        'T',        'H' | 0x80, '(',        '5',        ')',        '=',        ' ',
    'F',        'A',        'Y',        '4',        'V' | 0x80, ' ',        '(',        '6',
    '4',        ')',        ' ',        '=',        'S',        'I',        'H',        '4',
    'K',        'S',        'T',        'I',        'Y',        ' ',        'F',        'O',
    'H',        'R' | 0x80, '(',        '6',        ')',        '=',        ' ',        'S',
    'I',        'H',        '4',        'K',        'S' | 0x80, '(',        '7',        ')',
    '=',        ' ',        'S',        'E',        'H',        '4',        'V',        'U',
    'N' | 0x80, ' ',        '(',        '8',        'T',        'H',        ')',        '=',
    'E',        'Y',        '4',        'T',        'H' | 0x80, '(',        '8',        ')',
    '=',        ' ',        'E',        'Y',        '4',        'T' | 0x80, '(',        '9',
    ')',        '=',        ' ',        'N',        'A',        'Y',        '4',        'N' | 0x80,
    '(',        ':',        ')',        '=',        '.' | 0x80, '(',        ';',        ')',
    '=',        '.' | 0x80, '(',        '<',        ')',        '=',        ' ',        'L',
    'E',        'H',        '4',        'S',        ' ',        'D',        'H',        'A',
    'E',        'N' | 0x80, '(',        '=',        ')',        '=',        ' ',        'I',
    'Y',        '4',        'K',        'W',        'U',        'L',        'Z' | 0x80, '(',
    '>',        ')',        '=',        ' ',        'G',        'R',        'E',        'Y',
    '4',        'T',        'E',        'R',        ' ',        'D',        'H',        'A',
    'E',        'N' | 0x80, '(',        '?',        ')',        '=',        '?' | 0x80, '(',
    '@',        ')',        '=',        ' ',        'A',        'E',        '6',        'T' | 0x80,
    '(',        '^',        ')',        '=',        ' ',        'K',        'A',        'E',
    '4',        'R',        'I',        'X',        'T' | 0x80, ']',        'A' | 0x80};

