xMasterX/all-the-plugins/non_catalog_apps/chess/sam/stm32_sam.cpp
        // RULES FOR PHONEMES BEFORE R
        //        T R -> CH R
        // Example: TRACK

        // Get current position and phoneme
        X = pos;
        A = phonemeindex[pos];
        if(A != 23) goto pos41611; // 'R'

        // Look at prior phoneme
        X--;
        A = phonemeindex[pos - 1];
        //pos41567:
        if(A == 69) // 'T'
        {
            phonemeindex[pos - 1] = 42;
            goto pos41779;
        }

        // RULES FOR PHONEMES BEFORE R
        //        D R -> J R
        // Example: DRY

        // Prior phonemes D?
        if(A == 57) // 'D'
        {
            // Change D to J
            phonemeindex[pos - 1] = 44;

            goto pos41788;
        }

        // RULES FOR PHONEMES BEFORE R
        //        <VOWEL> R -> <VOWEL> RX
        // Example: ART

        // If vowel flag is set change R to RX
        A = flags[A] & 128;

        if(A != 0) phonemeindex[pos] = 18; // 'RX'

        // continue to next phoneme
        pos++;
        continue;

    pos41611:

        // RULE:
        //       <VOWEL> L -> <VOWEL> LX
        // Example: ALL

        // Is phoneme L?
        if(A == 24) // 'L'
        {
            // If prior phoneme does not have VOWEL flag set, move to next phoneme
            if((flags[phonemeindex[pos - 1]] & 128) == 0) {
                pos++;
                continue;
            }
            // Prior phoneme has VOWEL flag set, so change L to LX and move to next phoneme

            phonemeindex[X] = 19; // 'LX'
            pos++;
            continue;
        }

        // RULE:
        //       G S -> G Z
        //
        // Can't get to fire -
        //       1. The G -> GX rule intervenes
        //       2. Reciter already replaces GS -> GZ

        // Is current phoneme S?
        if(A == 32) // 'S'
        {
            // If prior phoneme is not G, move to next phoneme
            if(phonemeindex[pos - 1] != 60) {
                pos++;
                continue;
            }
            // Replace S with Z and move on

            phonemeindex[pos] = 38; // 'Z'
            pos++;
            continue;
        }

        // RULE:
        //             K <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> KX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
        // Example: COW

        // Is current phoneme K?
        if(A == 72) // 'K'
        {
            // Get next phoneme
            Y = phonemeindex[pos + 1];
            // If at end, replace current phoneme with KX
            if(Y == 255)
                phonemeindex[pos] = 75; // ML : prevents an index out of bounds problem
            else {
                // VOWELS AND DIPHTONGS ENDING WITH IY SOUND flag set?
                A = flags[Y] & 32;

                // Replace with KX
                if(A == 0) phonemeindex[pos] = 75; // 'KX'
            }
        } else

            // RULE:
            //             G <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> GX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
            // Example: GO

            // Is character a G?
            if(A == 60) // 'G'
            {
                // Get the following character
                unsigned char index = phonemeindex[pos + 1];

                // At end of buffer?
                if(index == 255) //prevent buffer overflow
                {
                    pos++;
                    continue;
                } else
                    // If diphtong ending with YX, move continue processing next phoneme
                    if((flags[index] & 32) != 0) {
                        pos++;
                        continue;
                    }
                // replace G with GX and continue processing next phoneme

                phonemeindex[pos] = 63; // 'GX'
                pos++;
                continue;
            }

        // RULE:
        //      S P -> S B
        //      S T -> S D
        //      S K -> S G
        //      S KX -> S GX
        // Examples: SPY, STY, SKY, SCOWL

        Y = phonemeindex[pos];
        //pos41719:
        // Replace with softer version?
        A = flags[Y] & 1;
        if(A == 0) goto pos41749;
        A = phonemeindex[pos - 1];
        if(A != 32) // 'S'
        {
            A = Y;
            goto pos41812;
        }
        // Replace with softer version

        phonemeindex[pos] = Y - 12;
        pos++;
        continue;

    pos41749:

        // RULE:
        //      <ALVEOLAR> UW -> <ALVEOLAR> UX
        //
        // Example: NEW, DEW, SUE, ZOO, THOO, TOO

        //       UW -> UX

        A = phonemeindex[X];
        if(A == 53) // 'UW'
        {
            // ALVEOLAR flag set?
            Y = phonemeindex[X - 1];
            A = flags2[Y] & 4;
            // If not set, continue processing next phoneme
            if(A == 0) {
                pos++;
                continue;
            }

            phonemeindex[X] = 16;
            pos++;
            continue;
        }
    pos41779:

        // RULE:
        //       CH -> CH CH' (CH requires two phonemes to represent it)
        // Example: CHEW

        if(A == 42) // 'CH'
        {
            //        pos41783:

            Insert(X + 1, A + 1, mem59, stress[X]);
            pos++;
            continue;
        }

    pos41788:

        // RULE:
        //       J -> J J' (J requires two phonemes to represent it)
        // Example: JAY

        if(A == 44) // 'J'
        {
            Insert(X + 1, A + 1, mem59, stress[X]);
            pos++;
            continue;
        }

        // Jump here to continue
    pos41812:

        // RULE: Soften T following vowel
        // NOTE: This rule fails for cases such as "ODD"
        //       <UNSTRESSED VOWEL> T <PAUSE> -> <UNSTRESSED VOWEL> DX <PAUSE>
        //       <UNSTRESSED VOWEL> D <PAUSE>  -> <UNSTRESSED VOWEL> DX <PAUSE>
        // Example: PARTY, TARDY

        // Past this point, only process if phoneme is T or D

        if(A != 69) // 'T'
            if(A != 57) {
                pos++; // 'D'
                continue;
            }
        //pos41825:

        // If prior phoneme is not a vowel, continue processing phonemes
        if((flags[phonemeindex[X - 1]] & 128) == 0) {
            pos++;
            continue;
        }

        // Get next phoneme
        X++;
        A = phonemeindex[X];
        //pos41841
        // Is the next phoneme a pause?
        if(A != 0) {
            // If next phoneme is not a pause, continue processing phonemes
            if((flags[A] & 128) == 0) {
                pos++;
                continue;
            }
            // If next phoneme is stressed, continue processing phonemes
            // FIXME: How does a pause get stressed?
            if(stress[X] != 0) {
                pos++;
                continue;
            }
            //pos41856:
            // Set phonemes to DX

            phonemeindex[pos] = 30; // 'DX'
        } else {
            A = phonemeindex[X + 1];
            if(A == 255) //prevent buffer overflow
                A = 65 & 128;
            else
                // Is next phoneme a vowel or ER?
                A = flags[A] & 128;

            if(A != 0) phonemeindex[pos] = 30; // 'DX'
        }

