xMasterX/all-the-plugins/non_catalog_apps/chess/sam/stm32_sam.cpp
pos37440:

    Code37066(mem58);
    A = A & 32;
    if(A == 0) goto pos37184;
    mem58 = X;
    goto pos37440;
pos37455:
    Y = mem64;
    mem61 = mem60;

pos37461:
    //37461: LDA (62),y
    A = GetRuleByte(mem62, Y);
    mem57 = A;
    A = A & 127;
    if(A != '=') {
        mem56++;
        X = mem56;
        input[X] = A;
    }

    //37478: BIT 57
    //37480: BPL 37485  //not negative flag
    if((mem57 & 128) == 0) goto pos37485; //???
    goto pos36554;
pos37485:
    Y++;
    goto pos37461;
}

// Constructor

STM32SAM::STM32SAM(uint32_t STM32SAM_SPEED /* = 5 */) {
    STM32SAM_SPEED = STM32SAM_SPEED & 0x1f; // limit it from 0 to 31

    _STM32SAM_SPEED = STM32SAM_SPEED;

    // set default voice

    speed = 72;
    pitch = 64;
    mouth = 128;
    throat = 128;

    phonetic = 0;
    singmode = 0;

    wait1 = 7;
    wait2 = 6;

    mem59 = 0;

    oldtimetableindex = 0;
}

STM32SAM::STM32SAM() {
    _STM32SAM_SPEED = 7;

    // set default voice

    speed = 72;
    pitch = 64;
    mouth = 128;
    throat = 128;

    phonetic = 0;
    singmode = 0;

    wait1 = 7;
    wait2 = 6;

    mem59 = 0;

    oldtimetableindex = 0;
}

/*
  STM32SAM::~STM32SAM() {
  {
  // TODO: end();
  }
*/

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sam  (variable string,  phonetic, sing, pitch, speed, mouth, throat)
//           STM32SAM say (sing off, phonetic off) (const string)
//           STM32SAM say (sing off, phonetic off) (variable string)
//           STM32SAM sing (sing on, phonetic off) (const string)
//           STM32SAM sing (sing on, phonetic off) (variable string)
//           STM32SAM sayPhonetic (sing off, phonetic on) (const string)
//           STM32SAM sayPhonetic (sing off, phonetic on) (variable string)
//           STM32SAM singPhonetic (sing on, phonetic on) (const string)
//           STM32SAM singPhonetic (sing on, phonetic on) (variable string)
//           STM32SAM voice (pitch, speed, mouth, throat)
//           STM32SAM setPitch (pitch)
//           STM32SAM setSpeed (speed)
//           STM32SAM setMouth (mouth)
//           STM32SAM setThroat (throat)
//
//
////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sam  (const string,  phonetic, sing, pitch, speed, mouth, throat)
//
////////////////////////////////////////////////////////////////////////////////////////////

char to_upper_case(char c) {
    if(c >= 'a' && c <= 'z') {
        return c - 'a' + 'A';
    }
    return c;
}

void STM32SAM::sam(
    const char* argv,
    unsigned char _phonetic,
    unsigned char _singmode,
    unsigned char _pitch,
    unsigned char _speed,
    unsigned char _mouth,
    unsigned char _throat) {
    phonetic = _phonetic;
    singmode = _singmode;
    pitch = _pitch;
    speed = _speed;
    mouth = _mouth;
    throat = _throat;

    int i;

    for(i = 0; i < 256; i++) {
        input[i] = argv[i];
    }

    for(i = 0; input[i] != 0; i++) {
        if(i != 0) {
            input[i] = to_upper_case((int)argv[i]);
        }
    }

    if(!phonetic) {
        strncat(input, "[", 256);
        if(!TextToPhonemes((unsigned char*)input)) {
            // PrintUsage();
            return;
        }

    } else {
        strncat(input, "\x9b", 256);
    }

    SetInput(input);

    if(!SAMMain()) {
        return;
    }
}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sam  (variable string,  phonetic, sing, pitch, speed, mouth, throat)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::sam(
    char* argv,
    unsigned char _phonetic,
    unsigned char _singmode,
    unsigned char _pitch,
    unsigned char _speed,
    unsigned char _mouth,
    unsigned char _throat) {
    phonetic = _phonetic;
    singmode = _singmode;
    pitch = _pitch;
    speed = _speed;
    mouth = _mouth;
    throat = _throat;

    int i;

    for(i = 0; i < 256; i++) {
        input[i] = argv[i];
    }

    for(i = 0; input[i] != 0; i++) {
        if(i != 0) {
            input[i] = to_upper_case((int)argv[i]);
        }
    }

    if(i < 256) {
        input[i] = phonetic ? '\x9b' : '[';
    }

    if(!phonetic) {
        if(!TextToPhonemes((unsigned char*)input)) {
            return;
        }
    }

    SetInput(input);

    if(!SAMMain()) {
        return;
    }
}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM say(sing off, phonetic off) (const string)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::say(const char* argv) {
    int i;

    phonetic = 0;
    singmode = 0;

    char const_input[256];

    for(i = 0; i < 256; i++) {
        const_input[i] = argv[i];
    }

    sam(const_input, phonetic, singmode, pitch, speed, mouth, throat);
}

void STM32SAM::say(char* argv) {
    int i;

    phonetic = 0;
    singmode = 0;

    char const_input[256];

    for(i = 0; i < 256; i++) {
        const_input[i] = argv[i];
    }

    sam(const_input, phonetic, singmode, pitch, speed, mouth, throat);
}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sing (sing on, phonetic off)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::sing(const char* argv) {
    int i;

    phonetic = 0;
    singmode = 1;

    char const_input[256];

    for(i = 0; i < 256; i++) {
        const_input[i] = argv[i];
    }

    sam(const_input, phonetic, singmode, pitch, speed, mouth, throat);
}

void STM32SAM::sing(char* argv) {
    int i;

    phonetic = 0;
    singmode = 1;

    char const_input[256];

    for(i = 0; i < 256; i++) {
        const_input[i] = argv[i];
    }

    sam(const_input, phonetic, singmode, pitch, speed, mouth, throat);
}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sayPhonetic (sing off, phonetic on)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::sayPhonetic(const char* argv) {
    int i;

