xMasterX/all-the-plugins/non_catalog_apps/chess/sam/stm32_sam.cpp
    phonetic = 1;
    singmode = 0;

    char const_input[256];

    for(i = 0; i < 256; i++) {
        const_input[i] = argv[i];
    }

    sam(const_input, phonetic, singmode, pitch, speed, mouth, throat);
}

void STM32SAM::sayPhonetic(char* argv) {
    int i;

    phonetic = 1;
    singmode = 0;

    char const_input[256];

    for(i = 0; i < 256; i++) {
        const_input[i] = argv[i];
    }

    sam(const_input, phonetic, singmode, pitch, speed, mouth, throat);
}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM singPhonetic (sing on, phonetic on)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::singPhonetic(const char* argv) {
    int i;

    phonetic = 1;
    singmode = 1;

    char const_input[256];

    for(i = 0; i < 256; i++) {
        const_input[i] = argv[i];
    }

    sam(const_input, phonetic, singmode, pitch, speed, mouth, throat);
}

void STM32SAM::singPhonetic(char* argv) {
    int i;

    phonetic = 1;
    singmode = 0;

    char const_input[256];

    for(i = 0; i < 256; i++) {
        const_input[i] = argv[i];
    }

    sam(const_input, phonetic, singmode, pitch, speed, mouth, throat);
}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM voice (pitch, speed, mouth, throat)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::setVoice(
    unsigned char _pitch /* = 64 */,
    unsigned char _speed /* = 72 */,
    unsigned char _mouth /* = 128 */,
    unsigned char _throat /* = 128 */) {
    pitch = _pitch;
    speed = _speed;
    mouth = _mouth;
    throat = _throat;
}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setPitch (pitch)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::setPitch(unsigned char _pitch /* = 64 */) {
    pitch = _pitch;
}
////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setSpeed (speed)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::setSpeed(unsigned char _speed /* = 72 */) {
    speed = _speed;
}
////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setMouth (mouth)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::setMouth(unsigned char _mouth /* = 128 */) {
    mouth = _mouth;
}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setThroat (throat)
//
////////////////////////////////////////////////////////////////////////////////////////////

void STM32SAM::setThroat(unsigned char _throat /* = 128 */) {
    throat = _throat;
}
////////////////////////////////////////////////////////////////////////////////////////////
//
//           Hardware
//
////////////////////////////////////////////////////////////////////////////////////////////
// Hardware specifics, for easier porting to other microcontrollers

//
// Set PA8 pin as PWM, at 256 timer ticks overflow (8bit resolution)

#include <math.h>
#include <stm32wbxx_ll_tim.h>

#define FURI_HAL_SPEAKER_TIMER   TIM16
#define FURI_HAL_SPEAKER_CHANNEL LL_TIM_CHANNEL_CH1

void STM32SAM::begin(void) {
#ifdef USE_ROGER_CORE

    pinMode(PA8, PWM); //   audio output pin

    Timer1.setPeriod(
        4); // Can't set at 256 ticks, only in uS. First nearest uS is 4 (Roger core is only for bluepill, that means 72*4=288 ticks, or 128*4=512 ticks when overclocked. It's ok, just overall volume will be lower, because maximum volume will be 256/288 or 256/512)

#endif

#ifdef USE_STM32duino_CORE
    pinMode(PA8, OUTPUT);

    PWM->pause();
    PWM->setMode(1, TIMER_OUTPUT_COMPARE_PWM1, PA8); // TIM1 CH1 (PA8)
    PWM->setPrescaleFactor(1);
    PWM->setOverflow(256, TICK_FORMAT); // 256 ticks overflow, no matter the CPU (timer) speed
    PWM->resume();

#endif

    LL_TIM_InitTypeDef TIM_InitStruct;
    memset(&TIM_InitStruct, 0, sizeof(LL_TIM_InitTypeDef));
    TIM_InitStruct.Prescaler = 4;
    TIM_InitStruct.Autoreload = 255;
    LL_TIM_Init(FURI_HAL_SPEAKER_TIMER, &TIM_InitStruct);

    LL_TIM_OC_InitTypeDef TIM_OC_InitStruct;
    memset(&TIM_OC_InitStruct, 0, sizeof(LL_TIM_OC_InitTypeDef));
    TIM_OC_InitStruct.OCMode = LL_TIM_OCMODE_PWM1;
    TIM_OC_InitStruct.OCState = LL_TIM_OCSTATE_ENABLE;
    TIM_OC_InitStruct.CompareValue = 127;
    LL_TIM_OC_Init(FURI_HAL_SPEAKER_TIMER, FURI_HAL_SPEAKER_CHANNEL, &TIM_OC_InitStruct);

    LL_TIM_EnableAllOutputs(FURI_HAL_SPEAKER_TIMER);
    LL_TIM_EnableCounter(FURI_HAL_SPEAKER_TIMER);
} // begin

inline void STM32SAM::SetAUDIO(unsigned char main_volume) {
#ifdef USE_ROGER_CORE
    Timer1.setCompare(TIMER_CH1, main_volume);
#endif

#ifdef USE_STM32duino_CORE
    PWM->setCaptureCompare(1, main_volume, TICK_COMPARE_FORMAT);
#endif

    // if(main_volume > 64) {
    //     LL_TIM_OC_SetCompareCH1(FURI_HAL_SPEAKER_TIMER, 127);
    // } else {
    //     LL_TIM_OC_SetCompareCH1(FURI_HAL_SPEAKER_TIMER, main_volume);
    // }

    float data = main_volume;
    data /= 255.0f;
    data -= 0.5f;
    data *= 4.0f;
    data = tanhf(data);

    data += 0.5f;
    data *= 255.0f;

    if(data < 0) {
        data = 0;
    } else if(data > 255) {
        data = 255;
    }

    LL_TIM_OC_SetCompareCH1(FURI_HAL_SPEAKER_TIMER, data);
}
